import { getArticle } from "@/api/ArticlesApi";
import { Text } from "@/components/ui/Text";
import { useLocalSearchParams } from "expo-router";
import { useEffect, useState } from "react";
import { ActivityIndicator, ScrollView, useWindowDimensions } from "react-native";
import { SafeAreaView } from "react-native-safe-area-context";
import RenderHtml, { MixedStyleRecord } from 'react-native-render-html';
import { Image, useTheme, View } from "tamagui";
import { useLingui } from "@lingui/react";
import { StatusBar } from "expo-status-bar";
import { navigationHeight } from "@/constants";

export default function ArticlesPage() {
  const { id } = useLocalSearchParams();
  const [article, setArticle] = useState<Article>();
  const [loading, setLoading] = useState(false);
  const { width } = useWindowDimensions();
  const theme = useTheme();
  const { i18n } = useLingui();

  useEffect(() => {
    if (id) {
      (async () => {
        try {
          setLoading(true);
          const res = await getArticle(id as string);
          setArticle(res);
        } catch (error) {
          console.error(error);
        } finally {
          setLoading(false);
        }
      }
      )()
    }
  }, []);

  if (loading || !article) {
    return <View style={{ flex: 1, justifyContent: 'center', alignItems: 'center' }}>
      <ActivityIndicator size="large" color="white" />
    </View>;
  }

  const tagsStyles: MixedStyleRecord = {
    body: {
      color: theme.color.val,
    },
    img: {
      width: width - 32,
      height: 180,
      borderRadius: 12,
    },
    blockquote: {
      fontStyle: "italic",
    }
  };


  return (
    <SafeAreaView style={{ flex: 1, paddingBottom: navigationHeight }}>
      <StatusBar />
      <ScrollView style={{ flex: 1 }} showsVerticalScrollIndicator={false}>
        <View p={16} style={{ flex: 1 }}>
          <Text fontSize={"$9"} fontWeight={"700"}>{article.title}</Text>
          <Text style={{ fontSize: 12, opacity: 0.7 }}>{new Date(article.created_at).toLocaleString()}</Text>
          <Image
            source={{ uri: article.image }}
            style={{
              flex: 1,
              height: 150,
              width: width - 32,
              borderRadius: 12,
              marginVertical: 10
            }}
          />
          <Text fontSize={"$5"} fontWeight={"700"}>{article.description}</Text>
          <RenderHtml
            contentWidth={width - 32}
            enableExperimentalMarginCollapsing={true}
            source={{ html: article.content }}
            tagsStyles={tagsStyles}
            renderersProps={{
              img: {
                enableExperimentalPercentWidth: true
              }
            }}
          />
        </View>
      </ScrollView>
    </SafeAreaView>
  );
}

const source = {
  html: `
  <p>
    لكي تصبح الفكرة منتجًا عاملاً، يجب أن تنتقل من مستوى الإبداع إلى مستوى
    التنظيم والتخطيط الواضح. للقيام بذلك بشكل صحيح، يحتاج المرء إلى عملية تطوير
    المنتج - "دليل خطوة بخطوة"، والذي سيساعد في جمع المعلومات، وتنظيم العمل،
    وتحديد بعض المواعيد النهائية، وتجميع أفضل فريق.
  </p>
  <p>
    أدناه، سنقوم بتحليل الخطوات المضمنة في عملية تطوير المنتج، ولماذا نحتاج
    إليها، وما هي زيادات المنتج التي تجلبها، ومن المسؤول عنها.
  </p>

  <h2 id="First-steps">الخطوات الأولى</h2>

  <p>
    لقد حان هذا اليوم. لقد قمت برعاية فكرتك لأكثر من عام حتى الآن وناقشتها مع
    مجموعة كاملة من الأشخاص. لقد حان الوقت لتحقيق أحلامك أخيرًا وتقديم شيء جديد
    ومفيد للعالم.
  </p>
  <p>
    للانتقال من الفكرة إلى تطوير المنتج، عليك أن تكون واثقًا من أن منتجك يلبي
    حاجة العملاء المستقبليين التي لم يلبها أحد من قبل (أو على الأقل هذا يفعلها
    بشكل أفضل مما هو متاح حاليًا في السوق). هناك ضمان بنسبة 100% تقريبًا بأن
    خطتك لن تنجح إذا لم تكن فكرتك مدعومة بأي من هذا، كونها مجرد خيال غريب أو
    مجرد تقليد. لن نتحدث عن هذه المنتجات نظرًا لأن هذه المنتجات لا تدوم عادةً
    لمدة عام، وهي في الأساس مضيعة للمال والموارد. يتم التخلص منها لعدة أسباب،
    وسنناقش أدناه الأخطاء الأكثر شيوعًا التي ترتكبها الشركات الناشئة وطرق ضبط
    عملياتك بشكل صحيح لتجنبها.
  </p>

  <p>
    يمكنك إما القيام بذلك بنفسك أو إشراك بعض المتخصصين، ولكننا نوصي بشدة بالحذر
    بشأن الإسراع بمنتجك إلى مرحلة التطوير (ولكن ليس الحذر الشديد - فالتوقيت
    الجيد يمثل أحيانًا 80٪ من النجاح). على أي حال، عندما يكون لديك بعض البيانات
    الملموسة لدعم فكرتك، وتعرف سبب قيامك بذلك، يمكنك أخيرًا تعيين فريقك الأول
    والبدء. يمكن الاستعانة بمصادر خارجية للفريق أو داخليًا، والأمر متروك لك
    لاتخاذ القرار
  </p>

  <h2 id="The-main-stages-of-product-development">
    المراحل الرئيسية لتطوير المنتج
  </h2>
  <h3>اكتشاف</h3>

  <p>
    حسنًا، أنت هنا في مكتب أو تجري مكالمة عبر Zoom مع مدير المشروع الخاص بك ومن
    المحتمل أن يكون هناك بعض أعضاء الفريق الآخرين الذين سيعملون على مشروعك. أين
    تبدأون جميعا؟ أولاً، أنت بحاجة إلى مرحلة اكتشاف مناسبة. يتضمن ذلك إجراء
    البحث، وكتابة بعض المواصفات الفنية، وإنشاء إثبات للمفهوم (PoC)، والخروج
    بقائمة من المهام أو الملاحم عالية المستوى.
  </p>
  <p>
    لماذا نحتاج إلى مرحلة الاكتشاف على أية حال؟ للتأكد من أننا لا ننفق بضعة أشهر
    من الميزانية على تنفيذ ميزة جديدة لن يحتاجها المستخدمون. أو أننا لا نختار
    تقنية أو خدمة قديمة من شأنها أن تمنعنا من إضافة وظائف جديدة خلال عام واحد.
    أو أن بنية نظامنا لن تكون قادرة على التعامل مع عدد كبير من المستخدمين. أو
    أننا نقضي عامين في تطوير شيء ما فقط لنكتشف أن لدينا الآن 10 منافسين جدد
    وبعضهم أفضل منا. وهذه القائمة ممكن تستمر وتستمر.
  </p>

  <p>
    كيف يمكننا تحديد العقبات التي قد نواجهها على طول الطريق؟ من خلال تحليل
    المخاطر. ويتضمن فحص كيفية تغير نتائج المشروع وأهدافه بسبب تأثير حدث الخطر.
    بمجرد تحديد المخاطر، يتم تحليلها لتحديد تأثيرها النوعي والكمي على المشروع
    بحيث يمكن اتخاذ الخطوات المناسبة للتخفيف منها.
  </p>

  <p>
    عادة ما تكون المخاطر الرئيسية هي نفسها، ونحن نبذل قصارى جهدنا لتغطيتها في
    أقرب وقت ممكن:
  </p>

  <ol>
    <li>تجاوز الميزانية.</li>
    <li>تجاوز الجدول الزمني.</li>
    <li>اختيار التكنولوجيا.</li>
    <li>ترحيل المحتوى والبيانات.</li>
    <li>التكامل مع خدمات الطرف الثالث.</li>
    <li>
      فقدان حركة المرور،
      <a
        href="http://jehad.pro/blog/7-nsayh-lthsyn-mhrkat-albhth-ltaazyz-tsnyfat-mokaa-aloyb-algdyd-alkhas-bk"
        target="_blank"
        rel="noopener noreferrer"
        >SEO</a
      >
    </li>
    <li>جودة الكود</li>
  </ol>

  <p>عندما نقوم بتقييم المخاطر، نستخدم risk matrix.</p>

  <figure>
    <div style="background-color: #f8f8f8;">
      <img
        style="object-fit: cover; width: 100%; max-height: 350px; aspect-ratio: 16/9; align-self: center;"
        src="https://th.bing.com/th/id/OIP.EKxkhulCPo2M5eP6LEOAHAHaLL"
      />
    </div>
    <figcaption>تعتبر risk matrix أداة لا تقدر بثمن</figcaption>
  </figure>

  <p>
    التعرض للمخاطر أو نقاط المخاطرة هي القيمة التي يتم تحديدها عن طريق ضرب تصنيف
    التأثير (مرتفع - كارثي (التصنيف أ - 100)؛ متوسط - حرج (التصنيف ب - 50)؛
    منخفض - هامشي (التقييم ج - 10) مع احتمالية المخاطر (عالية - (80% ≥ x ≥
    100%)، متوسط-مرتفع – (60% ≥ x < 80%)، متوسط-منخفض – (30% ≥ x < 60%): منخفض –
    (0 % < x < 30%).
  </p>

  <p>
    نستخدم بعد ذلك القيم الناتجة لإضافة المخاطر التي نعرفها إلى المصفوفة.
    والقاعدة الأساسية هنا هي التوصل إلى رد على كل ما نعرفه ولكن قبول حقيقة
    احتمال حدوث بعض المخاطر البسيطة والمتوسطة المستوى غير المحددة. لا يمكنك
    التنبؤ بالمستقبل، ولكن يمكنك إعداد نفسك بشكل أفضل لما يخبئه لك المستقبل.
  </p>

  <p>
    في بعض الأحيان يمكننا تخطي بعض الخطوات، ولكن من الأفضل عادةً قضاء أسبوع آخر
    في البحث بدلاً من مطالبة المطورين بتغيير إطار العمل بعد شهرين من بدء العمل.
  </p>

  <p>
    تعد المواصفات الفنية أيضًا جزءًا مهمًا من أي مشروع - سيشكرك المطورون عندما
    يرون مستندًا مناسبًا يصف بنية المشروع وأفضل الممارسات والاختناقات المحتملة
    والمخاوف وما إلى ذلك. أيضًا، لن يضطروا إلى الجلوس لعدة مكالمات مع عشرة أعضاء
    من الفريق، نصفهم سيتساءل عن سبب وجودهم هناك، بينما يعتقد النصف الآخر أنه كان
    من الممكن استبدال كل ذلك بسهولة بمواصفات تقنية مناسبة أو بريد الكتروني.
  </p>

  <h3>إثبات المفهوم (PoC)</h3>

  <p>
    يمكن في بعض الأحيان تخطي هذا الجزء، خاصة إذا كان المنتج صغيرًا أو كان الفريق
    الذي يعمل عليه من ذوي الخبرة في هذا النوع من البرامج. عادةً ما يتم تصميم
    إثباتات المفهوم (PoCs) لاختبار بعض التقنيات الجديدة والتأكد ببساطة من أن كل
    ما تريده في منتجك سيعمل بالطريقة التي من المفترض أن يعمل بها في مراحل لاحقة.
    تم حظر العديد من المشاريع الرائعة أو حتى إسقاطها بسبب تبين أن المنتج الذي تم
    تطويره غير صالح للعمل، أو أن بعض واجهات برمجة التطبيقات (API) لم تعمل، أو أن
    الاستضافة كانت بسيطة للغاية بالنسبة للتقنيات المستخدمة.
  </p>

  <blockquote>
    في بعض الأحيان، يرغب العملاء في استخدام إحدى الميزات التي شاهدوها في مكان ما
    على الويب، ومن واجبنا التأكد من إمكانية تنفيذ هذه الميزة. من يدري، ربما قضى
    أحد المنافسين عامًا واحدًا من وقت التطوير في تنفيذه، ونحن ببساطة لا نملك
    الموارد الكافية لفعل الشيء نفسه.
  </blockquote>

  <h3>تصميم</h3>

  <p>
    على الرغم من أن هذه مجرد نقطة واحدة، إلا أن هذا في الواقع مشروع مختلف تمامًا
    داخل التطوير. كما أن لها مراحلها وعملياتها الخاصة، لكننا لن نتناولها
    بالتفصيل. نبدأ بمفهوم التصميم الذي يغطي جميع الوظائف المطلوبة، ونمر عبر
    التكرارات المتعددة ونصل أخيرًا إلى تجربة المستخدم - إطار سلكي لكيفية ظهور
    منتجك.
  </p>

  <blockquote>
    عندما نعمل على بعض حلول B2B أو B2C، عادةً ما يهتم العملاء أكثر بالوظائف
    وتجربة المستخدم بدلاً من التصميم، لذلك يمكن أن تكون تجربة المستخدم هذه بسيطة
    إلى حد ما من حيث التصميم.
  </blockquote>

  <p>
    وفي النهاية، يمكننا دائمًا تحسين التصميم بمجرد نشر المنتج. بعد الانتهاء من
    تجربة المستخدم وتأكيدها، يقوم مصممونا بإنشاء واجهة مستخدم - وهو الملف نفسه
    الذي سيستخدمه المطورون للترميز
  </p>

  <h3>تحديد المهام عالية المستوى</h3>

  <p>
    هذا هو وقت مدير المشروع الخاص بك للتألق. الجميع يحب التذكرة الجيدة والشاملة،
    ولكن علينا أن نبدأ بمستوى أعلى أولاً. سيتحدث مدير المشروع الخاص بك إلى
    الفريق ويحدد الجوانب الرئيسية للمشاريع المستقبلية وجداولها الزمنية. ثم
    يقومون بنقلهم جميعًا إلى أداة تعقب المهام وسيستخدمون هذه المهام لاحقًا كأساس
    لكل شيء أكثر تفصيلاً.
  </p>
  `
}
